{
    "games": [
        {
            "name": "Hearts",
            "id": 1,
            "MinNumberOfPlayers": 3,
            "MaxNumberOfPlayers": 8,
            "NumberOfDecks": 1,
            "AverageMinutes": 15,
            "KindOfDeck": "A normal 52 card deck that has the 4 suits and no jokers",
            "image": "https://images.saymedia-content.com/.image/ar_3:2%2Cc_limit%2Ccs_srgb%2Cfl_progressive%2Cq_auto:eco%2Cw_700/MTc0NDYwNDM5NTcyMzkxNTU4/how-to-play-hearts-card-games-on-a-computer.jpg",
            "rules": {
                "basic": [
                    "In the same suit: Ace is highest; ace > king > queen > jack > 10 > 9 > 8 > 7 > 6 > 5 > 4 > 3 > 2 > non-suit-followers",
                    "The suits are: Hearts, Spades, Clubs, and Diamonds",
                    "You must follow suit, and play it if you have it.",
                    "If you cannot follow suit: if you have the queen of spades in your hand: you must drop it; otherwise you can play any card",
                    "To take the trick and the lead (if you did not already have it), you must play a card in suit, in your hand, that ranks above all of the other cards played in suit.",
                    "After taking a trick and the lead, you get to pick the next card and suit to lead with.",
                    "The trick is when all players have each played one card face up in the middle of the table for all to see.",
                    "The First Trick NOTE: When 52 is not evenly divisible by the number of players (52 divided by 3 = 17 remainder 1), the extra card(s) are face down and will be awarded to the person who took the first trick. Only they can see these.",
                    "Only the last played trick is allowed to be shown to all players if one requests it minus any extra cards or other tricks.",
                    "If a Rule Violation is declared and proved, the player that violated it gets 25 points added to thier score and the caller gets 1 point added to the caller's score. The rest get zero for that hand.",
                    "Premature Termination: is achieved when no more hearts are out there and the queen of spades has already been played and it is not possible for one to make the sun.",
                    "The other way to achieve Premature Termination is when one player has the lead and cannot get rid of it!",
                    "Calling Premature Termination: If that person declares the rest are theirs (to call it) and lied, they get all but one of the rest out there.",
                    "Shooting the Moon: is achieved by the player that gets all 13 hearts and the Queen of Spades.",
                    "Shooting the Sun: is achieved by the player that gets the entire deck (all 52 cards).",
                    "If someone shoots the moon, he or she adds zero (0) points to their score, and the shooter's apponents all add 26 points to their score each.",
                    "If someone shoots the sun, he or shee adds (0) points to their score, and the shooter's apponents all add 52 points to their score each.",
                    "Lowest Score Wins: Loser is first above 100 points.",
                    "You all pick the order and the passing strategies used (Person A always leads right, Person B always leads left, Person C always leads Hold, or have the lead rotate when you have more people than passing strategies). Suggested for 3 people: Right, Left, Hold; Suggested for 4 people: Right, Left, Accross or One-To-Each, Hold"
                ],
                "vegas-style":
                [
                    "Person who has the 2 of clubs goes first, or next lowest when all players don't have it",
                    "Always play it out.",
                    "No hearts can be lead until a heart or the Queen of Spades has been dropped (aside from the first trick)."
                ]
            },
            "strategies": [
                "The probability for each hand of the first trick being a heart or the Queen of Spades unknown is: 14/52 or 7/26 roughly 26%. If the shooter did not take the first trick, then roughly 26% of the time they lose if and only if it comes down to the first trick. I don't know about you, I'd take the 74% chance of the time winning.",
                "THE MOON OR THE SUN: You could have the hand for it (for the SUN it looks like having all of one suit and all aces and a king (self sun shoot), that is one such) (for the moon it looks like having at least Ace, King, Queen, Jack of Hearts and requiring them to be evenly split and you getting the lead, that is one such), or",
                "THE MOON OR THE SUN: play with people who let you shoot by intentionally playing just under each time, or",
                "THE MOON: shoot via Premature Termination (meaning: THE REST ARE YOURS (if no hearts and the queen of spades have not been dropped on anyone other than the shooter, it works) you played your lower card while they played thier higher cards making your cards high at the end) (down side to this: is forfiet the Sun unless you took the first trick, and you will get stuck with a whole lot of points if you don't make it).,",
                "To try to get zero by: shooting the Moon or the Sun. or",
                "To try to get zero by: playing just under the leader when the leader plays high. This ensures that you are dropping your high cards. So you are less likely to get stuck with the lead at the end. The downside of doing this: you are playing right into a shooters hand or (you are letting a shooter shoot the moon or the sun).",
                "To try to get zero by: short suiting yourself when you pass, so you can drop the Queen of Spades or your hearts and make sure that you cannot get stuck with the lead.",
                "To try to get zero by: When there is a shooter, the shooter must be stopped first. Sacrifice to stop a shooter, then manage to get rid of the lead."
            ]
        },
        {
            "name": "name",
            "id": 0,
            "MinNumberOfPlayers": 0,
            "MaxNumberOfPlayers": 0,
            "NumberOfDecks": 0,
            "AverageMinutes": 0,
            "KindOfDeck": "A normal 52 card deck that has the 4 suits and no jokers",
            "image": "url",
            "rules": {
                "basic": []
            },
            "strategies": []
        },
        {
            "name": "name",
            "id": 0,
            "MinNumberOfPlayers": 0,
            "MaxNumberOfPlayers": 0,
            "NumberOfDecks": 0,
            "AverageMinutes": 0,
            "KindOfDeck": "A normal 52 card deck that has the 4 suits and no jokers",
            "image": "url",
            "rules": {
                "basic": []
            },
            "strategies": []
        }
    ]
}
